====================
Single Quoted String
====================

"single quoted \" use "

---

(source_file 
  (string)
)

===================
Single empty String
===================

""
use ""

---

(source_file
  (string)
  (use_statement (string))
)

=======================
Single Multiline String
=======================

"
multi
use
"

---

(source_file 
  (string)
)

===================
Triple empty String
===================

""""""

---

(source_file (string))

=========================
Triple multiline String
=========================

"""
multi
line
use "foo"
"""

---

(source_file
  (string)
)

=========================
Block Quote Triple String
=========================

/**
"""
"""
*/

---

(source_file (block_comment))

================================
Block Quote before Triple String
================================

/**/
"""
hdfjdf
"""

---

(source_file 
  (block_comment)
  (string)
)

==============
4-quote string
==============

primitive Foo
  fun apply(): String =>
    """"Foo""""

---
(source_file
  (primitive_definition
    (identifier)
    (method
      (identifier)
      (parameters)
      returns: (base_type name: (identifier))
      (block (literal (string)))
    )
  )
)


